'=================GIT==============================='
# это распределенная система контроля версий(это сиситрема, заприсывающая изменения в файлах или наборе файлах в теченни времен)Преднозначен для ослеживания и ведения истории измения файлов, в вашем проекте

'=============================GITHUB===================='
# это сайт куда я могу отправить все что нходиттся на моем ноутбуке, чтобы другие люди могли просмотреть мой код и мой прогресс, так же использовать мой код

'Репозиторий'
# 1.локальный(на ПК)
# 2.удаленный(на каком-то сервисе, который предоставляет репозиторий (GITHUB))

# 1 git init - инициализируем гит (создается скрытая дириктория .git)
# 2 git add - добовляет изменнеия к файла, который вы указываете в индекс
# 3 git commit - m 'описание изменения' - берет из индекса изменения, фиксирует и сщхрфнет в локальные репозитория 
# 4 git remote add ssh_ссылка - связывает локальный репозиторий с удаленным
# 5 git push {называет связки, который вы указываете при remote add} {названия вектора} отравляет данные с локального репозиторий 




